app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Post By 2nd User"], ["body", "post created by 2nd user at 11:40 feb 21"], ["created_at", "2018-02-21 06:14:44.196905"], ["updated_at", "2018-02-21 06:14:44.196905"], ["user_id", 2]]
---
  def create
  	@book = current_user.books.build(book_params)
  	if @book.save

UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "Post created at 5:10 feb 20 by user\r\nUpdated at 5:34"], ["updated_at", "2018-02-20 12:04:47.710221"], ["id", 2]]
---
  def update
  	if @book.update(book_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_book
  	@book = Book.find(params[:id])